app/controllers/twitter_accounts_controller.rb

SELECT "twitter_accounts".* FROM "twitter_accounts"
---
  def index
    @twitter_accounts = TwitterAccount.all

INSERT INTO "twitter_accounts" ("actress", "created_at", "twitter_url", "updated_at") VALUES (?, ?, ?, ?)  [["actress", "selena"], ["created_at", Thu, 06 Mar 2014 05:56:20 UTC +00:00], ["twitter_url", "selenagomez"], ["updated_at", Thu, 06 Mar 2014 05:56:20 UTC +00:00]]
---
  def create
    @twitter_account = TwitterAccount.new(twitter_account_params)

    respond_to do |format|
      if @twitter_account.save

SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_twitter_account
      @twitter_account = TwitterAccount.find(params[:id])